In [1]:
from google.colab import drive

In [2]:
drive.mount("/content.gdrive")

Mounted at /content.gdrive

In [3]:
import pandas as pd

In [4]:
Data = pd.read_excel(r"//content/Data.xlsx")

In [5]:
display(pd.DataFrame(Data))

,Start Date,End Date,TOWN,Super Petrol,Diesel,Kerosene
0,2023-07-15,2023-08-14,Mombasa,191.623637,176.628095,166.432575
1,2023-07-15,2023-08-14,Kilifi,192.393558,177.398016,167.192497
2,2023-07-15,2023-08-14,Likoni Mainland,192.003637,177.018095,166.812575
3,2023-07-15,2023-08-14,Kwale,192.003637,177.018095,166.812575
4,2023-07-15,2023-08-14,Malindi,192.615161,177.619619,167.414099
...,...,...,...,...,...,...
3526,2021-11-15,2021-12-14,Mbita,130.930000,112.100000,105.070000
3527,2021-11-15,2021-12-14,Mbale,130.120000,111.300000,104.260000
3528,2021-11-15,2021-12-14,Etago,131.580000,112.750000,105.720000
3529,2021-11-15,2021-12-14,Magenche,131.670000,112.860000,105.820000
3530,2021-11-15,2021-12-14,Kilgoris,131.510000,112.690000,105.660000

In [6]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.9 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [7]:
%load_ext sql

In [8]:
%%sql

sqlite:///OilPrices.db

In [9]:
%%sql

CREATE TABLE Towns (
    TownID INT PRIMARY KEY,
    TownName VARCHAR(255) NOT NULL
);

 * sqlite:///OilPrices.db
Done.

[]

In [10]:
%%sql

CREATE TABLE FuelPrices (
    PriceID INT PRIMARY KEY,
    StartDate DATE NOT NULL,
    EndDate DATE NOT NULL,
    TownID INT,
    SuperPetrol DECIMAL(10, 2) NOT NULL,
    Diesel DECIMAL(10, 2) NOT NULL,
    Kerosene DECIMAL(10, 2) NOT NULL,
    FOREIGN KEY (TownID) REFERENCES Towns (TownID)
);

 * sqlite:///OilPrices.db
Done.

[]

In [11]:
%%sql

INSERT INTO Towns (TownID, TownName)
VALUES
    (1, 'Mombasa'),
    (2, 'Kilifi'),
    (3, 'Likoni Mainland'),
    (4,  "Kwale"),
    (5,  "Malindi")
    ;

 * sqlite:///OilPrices.db
5 rows affected.

[]

In [12]:
%%sql

INSERT INTO FuelPrices (PriceID, StartDate, EndDate, TownID, SuperPetrol, Diesel, Kerosene)
VALUES
    (001, '2023-07-15', '2023-08-14', 1, 191.62, 176.63, 166.43),
    (002, '2023-07-15', '2023-08-14', 2, 192.39, 177.40, 167.19),
    (003, '2023-07-15', '2023-08-14', 3, 192.00, 177.02, 166.81),
    (004, '2023-07-15', '2023-08-14', 4, 192.00, 177.02, 166.81),
    (005, '2023-07-15', '2023-08-14', 5, 192.62, 177.62, 167.41)
    ;

 * sqlite:///OilPrices.db
5 rows affected.

[]

In [13]:
%%sql

SELECT *FROM TOWNS

 * sqlite:///OilPrices.db
Done.

[(1, 'Mombasa'),
 (2, 'Kilifi'),
 (3, 'Likoni Mainland'),
 (4, 'Kwale'),
 (5, 'Malindi')]

In [14]:
%%sql

SELECT * FROM FuelPrices

 * sqlite:///OilPrices.db
Done.

[(1, '2023-07-15', '2023-08-14', 1, 191.62, 176.63, 166.43),
 (2, '2023-07-15', '2023-08-14', 2, 192.39, 177.4, 167.19),
 (3, '2023-07-15', '2023-08-14', 3, 192, 177.02, 166.81),
 (4, '2023-07-15', '2023-08-14', 4, 192, 177.02, 166.81),
 (5, '2023-07-15', '2023-08-14', 5, 192.62, 177.62, 167.41)]

Retrieve Fuel Prices for a Specific Town (e.g., Mombasa):

In [15]:
%%sql

SELECT Towns.TownName, FuelPrices.StartDate, FuelPrices.EndDate, FuelPrices.SuperPetrol, FuelPrices.Diesel, FuelPrices.Kerosene
FROM FuelPrices
INNER JOIN Towns ON FuelPrices.TownID = Towns.TownID
WHERE Towns.TownName IN ('Mombasa', "Kilifi", "Likoni Mainland", "Kwale", "Malindi");

 * sqlite:///OilPrices.db
Done.

[('Mombasa', '2023-07-15', '2023-08-14', 191.62, 176.63, 166.43),
 ('Kilifi', '2023-07-15', '2023-08-14', 192.39, 177.4, 167.19),
 ('Likoni Mainland', '2023-07-15', '2023-08-14', 192, 177.02, 166.81),
 ('Kwale', '2023-07-15', '2023-08-14', 192, 177.02, 166.81),
 ('Malindi', '2023-07-15', '2023-08-14', 192.62, 177.62, 167.41)]

In [16]:
%%sql

SELECT Towns.TownName, MAX(FuelPrices.SuperPetrol) AS MaxSuperPetrolPrice
FROM FuelPrices
INNER JOIN Towns ON FuelPrices.TownID = Towns.TownID;

 * sqlite:///OilPrices.db
Done.

[('Malindi', 192.62)]

In [17]:
%%sql

CREATE TABLE TownsTZ (
    TownID INT PRIMARY KEY,
    TownName VARCHAR(255) NOT NULL
);

 * sqlite:///OilPrices.db
Done.

[]

In [18]:
%%sql
CREATE TABLE TZFuelPrices (
    PriceID INT PRIMARY KEY,
    StartDate DATE NOT NULL,
    EndDate DATE NOT NULL,
    TownID INT,
    Petrol DECIMAL(10, 2) NOT NULL,
    Diesel DECIMAL(10, 2) NOT NULL,
    Kerosene DECIMAL(10, 2) NOT NULL,
    FOREIGN KEY (TownID) REFERENCES Towns (TownID)
);

 * sqlite:///OilPrices.db
Done.

[]

In [19]:
%%sql

INSERT INTO TownsTZ (TownID, TownName)
VALUES
    (1, 'Dares Salam'),
    (2, 'Arusha'),
    (3, 'Arumeru'),
    (4,  "Karatu"),
    (5,  "Longido")
    ;

 * sqlite:///OilPrices.db
5 rows affected.

[]

In [20]:
%%sql

INSERT INTO TZFuelPrices (PriceID, StartDate, EndDate, TownID, Petrol, Diesel, Kerosene)
VALUES
    (001, '2023-07-15', '2023-08-14', 1, 3281, 3448, 2943),
    (002, '2023-07-15', '2023-08-14', 2, 3365, 3532, 3027),
    (003, '2023-07-15', '2023-08-14', 3, 3365, 3532, 3027),
    (004, '2023-07-15', '2023-08-14', 4, 3383, 3550, 3046),
    (005, '2023-07-15', '2023-08-14', 5, 3376, 3543, 3038)
    ;

 * sqlite:///OilPrices.db
5 rows affected.

[]

In [21]:
%%sql

SELECT TownsTZ.TownName, TZFuelPrices.StartDate, TZFuelPrices.EndDate, TZFuelPrices.Petrol, TZFuelPrices.Diesel, TZFuelPrices.Kerosene
FROM TZFuelPrices
INNER JOIN TownsTZ ON TZFuelPrices.TownID = TownsTZ.TownID
WHERE TownsTZ.TownName IN ('Dares Salam', "Arusha", "Arumeru", "Karatu", "Longido");

 * sqlite:///OilPrices.db
Done.

[('Dares Salam', '2023-07-15', '2023-08-14', 3281, 3448, 2943),
 ('Arusha', '2023-07-15', '2023-08-14', 3365, 3532, 3027),
 ('Arumeru', '2023-07-15', '2023-08-14', 3365, 3532, 3027),
 ('Karatu', '2023-07-15', '2023-08-14', 3383, 3550, 3046),
 ('Longido', '2023-07-15', '2023-08-14', 3376, 3543, 3038)]

In [22]:
%%sql

-- Calculate average oil prices in Kenya
SELECT 'Kenya' AS Country,
       AVG(SuperPetrol) AS AvgSuperPetrol_Kenya,
       AVG(Diesel) AS AvgDiesel_Kenya,
       AVG(Kerosene) AS AvgKerosene_Kenya
FROM FuelPrices;

 * sqlite:///OilPrices.db
Done.

[('Kenya', 192.126, 177.13799999999998, 166.93)]

In [23]:
%%sql
-- Calculate average oil prices in Tanzania
SELECT 'Tanzania' AS Country,
       AVG(Petrol) AS AvgPetrol_Tanzania,
       AVG(Diesel) AS AvgDiesel_Tanzania,
       AVG(Kerosene) AS AvgKerosene_Tanzania
FROM TZFuelPrices;

 * sqlite:///OilPrices.db
Done.

[('Tanzania', 3354.0, 3521.0, 3016.2)]

In [24]:
%%sql

-- Compare oil prices between Kenya and Tanzania
SELECT 'Super Petrol' AS FuelType,
       AVG(SuperPetrol) AS AvgPrice_Kenya,
       (SELECT AVG(Petrol) FROM TZFuelPrices) AS AvgPrice_Tanzania
FROM FuelPrices
UNION
SELECT 'Diesel' AS FuelType,
       AVG(Diesel) AS AvgPrice_Kenya,
       (SELECT AVG(Diesel) FROM TZFuelPrices) AS AvgPrice_Tanzania
FROM FuelPrices
UNION
SELECT 'Kerosene' AS FuelType,
       AVG(Kerosene) AS AvgPrice_Kenya,
       (SELECT AVG(Kerosene) FROM TZFuelPrices) AS AvgPrice_Tanzania
FROM FuelPrices;

 * sqlite:///OilPrices.db
Done.

[('Diesel', 177.13799999999998, 3521.0),
 ('Kerosene', 166.93, 3016.2),
 ('Super Petrol', 192.126, 3354.0)]

In [25]:
%%sql

-- Calculate oil price changes over time in Kenya
WITH PriceChanges AS (
    SELECT TownID AS Region,
           StartDate,
           EndDate,
           SuperPetrol,
           Diesel,
           Kerosene,
           LAG(SuperPetrol) OVER (PARTITION BY TownID ORDER BY StartDate) AS PreviousSuperPetrol,
           LAG(Diesel) OVER (PARTITION BY TownID ORDER BY StartDate) AS PreviousDiesel,
           LAG(Kerosene) OVER (PARTITION BY TownID ORDER BY StartDate) AS PreviousKerosene
    FROM FuelPrices
)
SELECT Region,
       StartDate,
       SuperPetrol,
       SuperPetrol - PreviousSuperPetrol AS SuperPetrolPriceChange,
       Diesel,
       Diesel - PreviousDiesel AS DieselPriceChange,
       Kerosene,
       Kerosene - PreviousKerosene AS KerosenePriceChange
FROM PriceChanges;

 * sqlite:///OilPrices.db
Done.

[(1, '2023-07-15', 191.62, None, 176.63, None, 166.43, None),
 (2, '2023-07-15', 192.39, None, 177.4, None, 167.19, None),
 (3, '2023-07-15', 192, None, 177.02, None, 166.81, None),
 (4, '2023-07-15', 192, None, 177.02, None, 166.81, None),
 (5, '2023-07-15', 192.62, None, 177.62, None, 167.41, None)]

In [26]:
%%sql

-- Calculate oil price disparities between Kenyan towns
WITH PriceDisparities AS (
    SELECT TownID AS Region,
           StartDate,
           SuperPetrol,
           Diesel,
           Kerosene,
           MAX(SuperPetrol) OVER (PARTITION BY StartDate) - MIN(SuperPetrol) OVER (PARTITION BY StartDate) AS SuperPetrolDisparity,
           MAX(Diesel) OVER (PARTITION BY StartDate) - MIN(Diesel) OVER (PARTITION BY StartDate) AS DieselDisparity,
           MAX(Kerosene) OVER (PARTITION BY StartDate) - MIN(Kerosene) OVER (PARTITION BY StartDate) AS KeroseneDisparity
    FROM FuelPrices
)
SELECT Region,
       StartDate,
       SuperPetrolDisparity,
       DieselDisparity,
       KeroseneDisparity
FROM PriceDisparities;

 * sqlite:///OilPrices.db
Done.

[(1, '2023-07-15', 1.0, 0.9900000000000091, 0.9799999999999898),
 (2, '2023-07-15', 1.0, 0.9900000000000091, 0.9799999999999898),
 (3, '2023-07-15', 1.0, 0.9900000000000091, 0.9799999999999898),
 (4, '2023-07-15', 1.0, 0.9900000000000091, 0.9799999999999898),
 (5, '2023-07-15', 1.0, 0.9900000000000091, 0.9799999999999898)]

In [27]:
%%sql

CREATE TABLE InflationRates (
    InflationRateID INT PRIMARY KEY,
    Country CHAR(2) NOT NULL,
    InflationDate DATE NOT NULL,
    InflationRate DECIMAL(10, 2) NOT NULL
);

 * sqlite:///OilPrices.db
Done.

[]

In [28]:
%%sql

SELECT
    A.InflationDate,
    A.InflationRate AS InflationRate_Kenya,
    B.InflationRate AS InflationRate_Tanzania,
    A.InflationRate - B.InflationRate AS InflationRate_Difference
FROM InflationRates A
INNER JOIN InflationRates B
    ON A.InflationDate = B.InflationDate
    AND A.Country = 'KE'
    AND B.Country = 'TZ';

 * sqlite:///OilPrices.db
Done.

[]